import configparser
import os
# ==================================================================================================================================================================
# Класс для работы с файлами конфигурации
# При инициализации экземпляра класса необходимо указать путь до файла
# Если файл найден - будет открыть существующий файл, если файл не найден - создан новый
# > get(section,setting) - возвращает параметры настройки определенного раздела конфига
# > set(section,setting,value) - устанавливает значение параметра конфига"""
# ==================================================================================================================================================================
# Класс для работы с конфигом
class configurator(object):
    """Класс для работы с файлами конфигурации"""
    # **************************************************************************************************************************************************************
    # Инициализация класса
    def __init__(self,path):
        self.config = configparser.ConfigParser()
        self.path = path
        if os.path.exists(path):
            self.config.read(path)
        else:
            with open(self.path, "w") as file:
                self.config.write(file)
                self.config.read(path)
    # **************************************************************************************************************************************************************
    # Получение значения параметра конфига
    def get(self,section,setting):
        return(self.config.get(section,setting))
    # **************************************************************************************************************************************************************
    # Установка значения параметра конфига
    def set(self,section,setting,value):
        self.config.set(section,setting,value)
        with open(self.path, "w") as file:
            self.config.write(file)
# ==================================================================================================================================================================