import pymysql
# ==================================================================================================================================================================
# Класс для работы бота с его базой данных mySQL
# Для инициализации класса нужно передать IP хоста, логин, пароль и наименование базы данных, а так же объект LLC для логирования событий на случай ошибок
# > connect : подключение к БД - перед работой с БД к ней нужно подключиться
# > disconnect : отключение от БД - после работы от БД необходимо отключиться
# > isConnected : проверяет наличие подключения к БД, возвращает True если подключение есть и False если его нет
# > execute : выполняет sql-запрос и возвращает его результат
# ==================================================================================================================================================================
class mySQLConnector(object):
    """Класс для работы с БД mySQL"""
    # **************************************************************************************************************************************************************
    # Инициализация класса
    def __init__(self,host,user,pwrd,base,LLC):
        self.host = host
        self.user = user
        self.pwrd = pwrd
        self.base = base
        self.LLC  = LLC
    # **************************************************************************************************************************************************************
    # Выполнение sql-запроса
    def execute(self,request=''):
        try:
            sqlCon = pymysql.connect(
                host=self.host,
                user=self.user,
                password=self.pwrd,
                db=self.base,
                cursorclass=pymysql.cursors.DictCursor
                )
            sqlCur = sqlCon.cursor()
            sqlCur.execute(request)
            result = sqlCur.fetchall()
            sqlCon.commit()
            sqlCur.close()
            sqlCon.close()
            return(result)
        except Exception as e:
            self.LLC.addlog('error due executing SQL-request','error')
            self.LLC.addlog(request,'error')
            self.LLC.addlog(str(e),'error')
# ==================================================================================================================================================================
